///********************************************************************
//创建时间: 2011-10-22   15:00
//文件名:   Network.h
//作者:     陈存腾
//说明:     网络模块的一些共有数据
//
//*********************************************************************/
//
//#pragma once
//
//namespace Network
//{
//	// 服务器ERROR码
//	enum ErrorCode
//	{
//		ACCEPT = 0,
//		不能创建多个房间,
//		初始化Winsock失败,
//		创建Socket失败,
//		绑定Socket失败,
//		线程启动失败,
//		消息发送失败
//	};
//
//	// 客户端信息
//	struct clientInfo
//	{
//		std::wstring userID;
//		std::wstring dwIP;
//	};
//}